/* automatically generated by rust-bindgen 0.72.1 */

pub type intmax_t = i64;
pub type __time_t = i64;
pub type __syscall_slong_t = ::std::os::raw::c_long;

#[repr(C)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type emacs_env = emacs_env_28;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct emacs_value_tag {
    _unused: [u8; 0],
}
pub type emacs_value = *mut emacs_value_tag;
pub const emacs_variadic_function: _bindgen_ty_1 = -2;
pub type _bindgen_ty_1 = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct emacs_runtime {
    pub size: isize,
    pub private_members: *mut emacs_runtime_private,
    pub get_environment:
        ::std::option::Option<unsafe extern "C" fn(runtime: *mut emacs_runtime) -> *mut emacs_env>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of emacs_runtime"][::std::mem::size_of::<emacs_runtime>() - 24usize];
    ["Alignment of emacs_runtime"][::std::mem::align_of::<emacs_runtime>() - 8usize];
    ["Offset of field: emacs_runtime::size"][::std::mem::offset_of!(emacs_runtime, size) - 0usize];
    ["Offset of field: emacs_runtime::private_members"]
        [::std::mem::offset_of!(emacs_runtime, private_members) - 8usize];
    ["Offset of field: emacs_runtime::get_environment"]
        [::std::mem::offset_of!(emacs_runtime, get_environment) - 16usize];
};
pub type emacs_function = ::std::option::Option<
    unsafe extern "C" fn(
        env: *mut emacs_env,
        nargs: isize,
        args: *mut emacs_value,
        data: *mut ::std::os::raw::c_void,
    ) -> emacs_value,
>;
pub type emacs_finalizer =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void)>;
pub type emacs_finalizer_function = emacs_finalizer;
pub const emacs_funcall_exit_return: emacs_funcall_exit = 0;
pub const emacs_funcall_exit_signal: emacs_funcall_exit = 1;
pub const emacs_funcall_exit_throw: emacs_funcall_exit = 2;
pub type emacs_funcall_exit = ::std::os::raw::c_uint;
pub const emacs_process_input_continue: emacs_process_input_result = 0;
pub const emacs_process_input_quit: emacs_process_input_result = 1;
pub type emacs_process_input_result = ::std::os::raw::c_uint;
pub type emacs_limb_t = usize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct emacs_env_25 {
    pub size: isize,
    pub private_members: *mut emacs_env_private,
    pub make_global_ref: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, value: emacs_value) -> emacs_value,
    >,
    pub free_global_ref:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, global_value: emacs_value)>,
    pub non_local_exit_check:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env) -> emacs_funcall_exit>,
    pub non_local_exit_clear: ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env)>,
    pub non_local_exit_get: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            symbol: *mut emacs_value,
            data: *mut emacs_value,
        ) -> emacs_funcall_exit,
    >,
    pub non_local_exit_signal: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, symbol: emacs_value, data: emacs_value),
    >,
    pub non_local_exit_throw: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, tag: emacs_value, value: emacs_value),
    >,
    pub make_function: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            min_arity: isize,
            max_arity: isize,
            func: ::std::option::Option<
                unsafe extern "C" fn(
                    env: *mut emacs_env,
                    nargs: isize,
                    args: *mut emacs_value,
                    data: *mut ::std::os::raw::c_void,
                ) -> emacs_value,
            >,
            docstring: *const ::std::os::raw::c_char,
            data: *mut ::std::os::raw::c_void,
        ) -> emacs_value,
    >,
    pub funcall: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            func: emacs_value,
            nargs: isize,
            args: *mut emacs_value,
        ) -> emacs_value,
    >,
    pub intern: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            name: *const ::std::os::raw::c_char,
        ) -> emacs_value,
    >,
    pub type_of: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> emacs_value,
    >,
    pub is_not_nil:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> bool>,
    pub eq: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, a: emacs_value, b: emacs_value) -> bool,
    >,
    pub extract_integer: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> intmax_t,
    >,
    pub make_integer: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, n: intmax_t) -> emacs_value,
    >,
    pub extract_float:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> f64>,
    pub make_float:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, d: f64) -> emacs_value>,
    pub copy_string_contents: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            value: emacs_value,
            buf: *mut ::std::os::raw::c_char,
            len: *mut isize,
        ) -> bool,
    >,
    pub make_string: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            str_: *const ::std::os::raw::c_char,
            len: isize,
        ) -> emacs_value,
    >,
    pub make_user_ptr: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            fin: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
            ptr: *mut ::std::os::raw::c_void,
        ) -> emacs_value,
    >,
    pub get_user_ptr: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> *mut ::std::os::raw::c_void,
    >,
    pub set_user_ptr: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            arg: emacs_value,
            ptr: *mut ::std::os::raw::c_void,
        ),
    >,
    pub get_user_finalizer: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, uptr: emacs_value) -> emacs_finalizer,
    >,
    pub set_user_finalizer: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            arg: emacs_value,
            fin: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        ),
    >,
    pub vec_get: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, vector: emacs_value, index: isize) -> emacs_value,
    >,
    pub vec_set: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            vector: emacs_value,
            index: isize,
            value: emacs_value,
        ),
    >,
    pub vec_size: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, vector: emacs_value) -> isize,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of emacs_env_25"][::std::mem::size_of::<emacs_env_25>() - 232usize];
    ["Alignment of emacs_env_25"][::std::mem::align_of::<emacs_env_25>() - 8usize];
    ["Offset of field: emacs_env_25::size"][::std::mem::offset_of!(emacs_env_25, size) - 0usize];
    ["Offset of field: emacs_env_25::private_members"]
        [::std::mem::offset_of!(emacs_env_25, private_members) - 8usize];
    ["Offset of field: emacs_env_25::make_global_ref"]
        [::std::mem::offset_of!(emacs_env_25, make_global_ref) - 16usize];
    ["Offset of field: emacs_env_25::free_global_ref"]
        [::std::mem::offset_of!(emacs_env_25, free_global_ref) - 24usize];
    ["Offset of field: emacs_env_25::non_local_exit_check"]
        [::std::mem::offset_of!(emacs_env_25, non_local_exit_check) - 32usize];
    ["Offset of field: emacs_env_25::non_local_exit_clear"]
        [::std::mem::offset_of!(emacs_env_25, non_local_exit_clear) - 40usize];
    ["Offset of field: emacs_env_25::non_local_exit_get"]
        [::std::mem::offset_of!(emacs_env_25, non_local_exit_get) - 48usize];
    ["Offset of field: emacs_env_25::non_local_exit_signal"]
        [::std::mem::offset_of!(emacs_env_25, non_local_exit_signal) - 56usize];
    ["Offset of field: emacs_env_25::non_local_exit_throw"]
        [::std::mem::offset_of!(emacs_env_25, non_local_exit_throw) - 64usize];
    ["Offset of field: emacs_env_25::make_function"]
        [::std::mem::offset_of!(emacs_env_25, make_function) - 72usize];
    ["Offset of field: emacs_env_25::funcall"]
        [::std::mem::offset_of!(emacs_env_25, funcall) - 80usize];
    ["Offset of field: emacs_env_25::intern"]
        [::std::mem::offset_of!(emacs_env_25, intern) - 88usize];
    ["Offset of field: emacs_env_25::type_of"]
        [::std::mem::offset_of!(emacs_env_25, type_of) - 96usize];
    ["Offset of field: emacs_env_25::is_not_nil"]
        [::std::mem::offset_of!(emacs_env_25, is_not_nil) - 104usize];
    ["Offset of field: emacs_env_25::eq"][::std::mem::offset_of!(emacs_env_25, eq) - 112usize];
    ["Offset of field: emacs_env_25::extract_integer"]
        [::std::mem::offset_of!(emacs_env_25, extract_integer) - 120usize];
    ["Offset of field: emacs_env_25::make_integer"]
        [::std::mem::offset_of!(emacs_env_25, make_integer) - 128usize];
    ["Offset of field: emacs_env_25::extract_float"]
        [::std::mem::offset_of!(emacs_env_25, extract_float) - 136usize];
    ["Offset of field: emacs_env_25::make_float"]
        [::std::mem::offset_of!(emacs_env_25, make_float) - 144usize];
    ["Offset of field: emacs_env_25::copy_string_contents"]
        [::std::mem::offset_of!(emacs_env_25, copy_string_contents) - 152usize];
    ["Offset of field: emacs_env_25::make_string"]
        [::std::mem::offset_of!(emacs_env_25, make_string) - 160usize];
    ["Offset of field: emacs_env_25::make_user_ptr"]
        [::std::mem::offset_of!(emacs_env_25, make_user_ptr) - 168usize];
    ["Offset of field: emacs_env_25::get_user_ptr"]
        [::std::mem::offset_of!(emacs_env_25, get_user_ptr) - 176usize];
    ["Offset of field: emacs_env_25::set_user_ptr"]
        [::std::mem::offset_of!(emacs_env_25, set_user_ptr) - 184usize];
    ["Offset of field: emacs_env_25::get_user_finalizer"]
        [::std::mem::offset_of!(emacs_env_25, get_user_finalizer) - 192usize];
    ["Offset of field: emacs_env_25::set_user_finalizer"]
        [::std::mem::offset_of!(emacs_env_25, set_user_finalizer) - 200usize];
    ["Offset of field: emacs_env_25::vec_get"]
        [::std::mem::offset_of!(emacs_env_25, vec_get) - 208usize];
    ["Offset of field: emacs_env_25::vec_set"]
        [::std::mem::offset_of!(emacs_env_25, vec_set) - 216usize];
    ["Offset of field: emacs_env_25::vec_size"]
        [::std::mem::offset_of!(emacs_env_25, vec_size) - 224usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct emacs_env_26 {
    pub size: isize,
    pub private_members: *mut emacs_env_private,
    pub make_global_ref: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, value: emacs_value) -> emacs_value,
    >,
    pub free_global_ref:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, global_value: emacs_value)>,
    pub non_local_exit_check:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env) -> emacs_funcall_exit>,
    pub non_local_exit_clear: ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env)>,
    pub non_local_exit_get: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            symbol: *mut emacs_value,
            data: *mut emacs_value,
        ) -> emacs_funcall_exit,
    >,
    pub non_local_exit_signal: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, symbol: emacs_value, data: emacs_value),
    >,
    pub non_local_exit_throw: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, tag: emacs_value, value: emacs_value),
    >,
    pub make_function: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            min_arity: isize,
            max_arity: isize,
            func: ::std::option::Option<
                unsafe extern "C" fn(
                    env: *mut emacs_env,
                    nargs: isize,
                    args: *mut emacs_value,
                    data: *mut ::std::os::raw::c_void,
                ) -> emacs_value,
            >,
            docstring: *const ::std::os::raw::c_char,
            data: *mut ::std::os::raw::c_void,
        ) -> emacs_value,
    >,
    pub funcall: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            func: emacs_value,
            nargs: isize,
            args: *mut emacs_value,
        ) -> emacs_value,
    >,
    pub intern: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            name: *const ::std::os::raw::c_char,
        ) -> emacs_value,
    >,
    pub type_of: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> emacs_value,
    >,
    pub is_not_nil:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> bool>,
    pub eq: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, a: emacs_value, b: emacs_value) -> bool,
    >,
    pub extract_integer: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> intmax_t,
    >,
    pub make_integer: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, n: intmax_t) -> emacs_value,
    >,
    pub extract_float:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> f64>,
    pub make_float:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, d: f64) -> emacs_value>,
    pub copy_string_contents: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            value: emacs_value,
            buf: *mut ::std::os::raw::c_char,
            len: *mut isize,
        ) -> bool,
    >,
    pub make_string: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            str_: *const ::std::os::raw::c_char,
            len: isize,
        ) -> emacs_value,
    >,
    pub make_user_ptr: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            fin: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
            ptr: *mut ::std::os::raw::c_void,
        ) -> emacs_value,
    >,
    pub get_user_ptr: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> *mut ::std::os::raw::c_void,
    >,
    pub set_user_ptr: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            arg: emacs_value,
            ptr: *mut ::std::os::raw::c_void,
        ),
    >,
    pub get_user_finalizer: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, uptr: emacs_value) -> emacs_finalizer,
    >,
    pub set_user_finalizer: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            arg: emacs_value,
            fin: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        ),
    >,
    pub vec_get: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, vector: emacs_value, index: isize) -> emacs_value,
    >,
    pub vec_set: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            vector: emacs_value,
            index: isize,
            value: emacs_value,
        ),
    >,
    pub vec_size: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, vector: emacs_value) -> isize,
    >,
    pub should_quit: ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env) -> bool>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of emacs_env_26"][::std::mem::size_of::<emacs_env_26>() - 240usize];
    ["Alignment of emacs_env_26"][::std::mem::align_of::<emacs_env_26>() - 8usize];
    ["Offset of field: emacs_env_26::size"][::std::mem::offset_of!(emacs_env_26, size) - 0usize];
    ["Offset of field: emacs_env_26::private_members"]
        [::std::mem::offset_of!(emacs_env_26, private_members) - 8usize];
    ["Offset of field: emacs_env_26::make_global_ref"]
        [::std::mem::offset_of!(emacs_env_26, make_global_ref) - 16usize];
    ["Offset of field: emacs_env_26::free_global_ref"]
        [::std::mem::offset_of!(emacs_env_26, free_global_ref) - 24usize];
    ["Offset of field: emacs_env_26::non_local_exit_check"]
        [::std::mem::offset_of!(emacs_env_26, non_local_exit_check) - 32usize];
    ["Offset of field: emacs_env_26::non_local_exit_clear"]
        [::std::mem::offset_of!(emacs_env_26, non_local_exit_clear) - 40usize];
    ["Offset of field: emacs_env_26::non_local_exit_get"]
        [::std::mem::offset_of!(emacs_env_26, non_local_exit_get) - 48usize];
    ["Offset of field: emacs_env_26::non_local_exit_signal"]
        [::std::mem::offset_of!(emacs_env_26, non_local_exit_signal) - 56usize];
    ["Offset of field: emacs_env_26::non_local_exit_throw"]
        [::std::mem::offset_of!(emacs_env_26, non_local_exit_throw) - 64usize];
    ["Offset of field: emacs_env_26::make_function"]
        [::std::mem::offset_of!(emacs_env_26, make_function) - 72usize];
    ["Offset of field: emacs_env_26::funcall"]
        [::std::mem::offset_of!(emacs_env_26, funcall) - 80usize];
    ["Offset of field: emacs_env_26::intern"]
        [::std::mem::offset_of!(emacs_env_26, intern) - 88usize];
    ["Offset of field: emacs_env_26::type_of"]
        [::std::mem::offset_of!(emacs_env_26, type_of) - 96usize];
    ["Offset of field: emacs_env_26::is_not_nil"]
        [::std::mem::offset_of!(emacs_env_26, is_not_nil) - 104usize];
    ["Offset of field: emacs_env_26::eq"][::std::mem::offset_of!(emacs_env_26, eq) - 112usize];
    ["Offset of field: emacs_env_26::extract_integer"]
        [::std::mem::offset_of!(emacs_env_26, extract_integer) - 120usize];
    ["Offset of field: emacs_env_26::make_integer"]
        [::std::mem::offset_of!(emacs_env_26, make_integer) - 128usize];
    ["Offset of field: emacs_env_26::extract_float"]
        [::std::mem::offset_of!(emacs_env_26, extract_float) - 136usize];
    ["Offset of field: emacs_env_26::make_float"]
        [::std::mem::offset_of!(emacs_env_26, make_float) - 144usize];
    ["Offset of field: emacs_env_26::copy_string_contents"]
        [::std::mem::offset_of!(emacs_env_26, copy_string_contents) - 152usize];
    ["Offset of field: emacs_env_26::make_string"]
        [::std::mem::offset_of!(emacs_env_26, make_string) - 160usize];
    ["Offset of field: emacs_env_26::make_user_ptr"]
        [::std::mem::offset_of!(emacs_env_26, make_user_ptr) - 168usize];
    ["Offset of field: emacs_env_26::get_user_ptr"]
        [::std::mem::offset_of!(emacs_env_26, get_user_ptr) - 176usize];
    ["Offset of field: emacs_env_26::set_user_ptr"]
        [::std::mem::offset_of!(emacs_env_26, set_user_ptr) - 184usize];
    ["Offset of field: emacs_env_26::get_user_finalizer"]
        [::std::mem::offset_of!(emacs_env_26, get_user_finalizer) - 192usize];
    ["Offset of field: emacs_env_26::set_user_finalizer"]
        [::std::mem::offset_of!(emacs_env_26, set_user_finalizer) - 200usize];
    ["Offset of field: emacs_env_26::vec_get"]
        [::std::mem::offset_of!(emacs_env_26, vec_get) - 208usize];
    ["Offset of field: emacs_env_26::vec_set"]
        [::std::mem::offset_of!(emacs_env_26, vec_set) - 216usize];
    ["Offset of field: emacs_env_26::vec_size"]
        [::std::mem::offset_of!(emacs_env_26, vec_size) - 224usize];
    ["Offset of field: emacs_env_26::should_quit"]
        [::std::mem::offset_of!(emacs_env_26, should_quit) - 232usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct emacs_env_27 {
    pub size: isize,
    pub private_members: *mut emacs_env_private,
    pub make_global_ref: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, value: emacs_value) -> emacs_value,
    >,
    pub free_global_ref:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, global_value: emacs_value)>,
    pub non_local_exit_check:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env) -> emacs_funcall_exit>,
    pub non_local_exit_clear: ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env)>,
    pub non_local_exit_get: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            symbol: *mut emacs_value,
            data: *mut emacs_value,
        ) -> emacs_funcall_exit,
    >,
    pub non_local_exit_signal: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, symbol: emacs_value, data: emacs_value),
    >,
    pub non_local_exit_throw: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, tag: emacs_value, value: emacs_value),
    >,
    pub make_function: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            min_arity: isize,
            max_arity: isize,
            func: ::std::option::Option<
                unsafe extern "C" fn(
                    env: *mut emacs_env,
                    nargs: isize,
                    args: *mut emacs_value,
                    data: *mut ::std::os::raw::c_void,
                ) -> emacs_value,
            >,
            docstring: *const ::std::os::raw::c_char,
            data: *mut ::std::os::raw::c_void,
        ) -> emacs_value,
    >,
    pub funcall: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            func: emacs_value,
            nargs: isize,
            args: *mut emacs_value,
        ) -> emacs_value,
    >,
    pub intern: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            name: *const ::std::os::raw::c_char,
        ) -> emacs_value,
    >,
    pub type_of: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> emacs_value,
    >,
    pub is_not_nil:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> bool>,
    pub eq: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, a: emacs_value, b: emacs_value) -> bool,
    >,
    pub extract_integer: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> intmax_t,
    >,
    pub make_integer: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, n: intmax_t) -> emacs_value,
    >,
    pub extract_float:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> f64>,
    pub make_float:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, d: f64) -> emacs_value>,
    pub copy_string_contents: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            value: emacs_value,
            buf: *mut ::std::os::raw::c_char,
            len: *mut isize,
        ) -> bool,
    >,
    pub make_string: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            str_: *const ::std::os::raw::c_char,
            len: isize,
        ) -> emacs_value,
    >,
    pub make_user_ptr: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            fin: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
            ptr: *mut ::std::os::raw::c_void,
        ) -> emacs_value,
    >,
    pub get_user_ptr: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> *mut ::std::os::raw::c_void,
    >,
    pub set_user_ptr: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            arg: emacs_value,
            ptr: *mut ::std::os::raw::c_void,
        ),
    >,
    pub get_user_finalizer: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, uptr: emacs_value) -> emacs_finalizer,
    >,
    pub set_user_finalizer: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            arg: emacs_value,
            fin: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        ),
    >,
    pub vec_get: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, vector: emacs_value, index: isize) -> emacs_value,
    >,
    pub vec_set: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            vector: emacs_value,
            index: isize,
            value: emacs_value,
        ),
    >,
    pub vec_size: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, vector: emacs_value) -> isize,
    >,
    pub should_quit: ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env) -> bool>,
    pub process_input: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env) -> emacs_process_input_result,
    >,
    pub extract_time: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> timespec,
    >,
    pub make_time: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, time: timespec) -> emacs_value,
    >,
    pub extract_big_integer: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            arg: emacs_value,
            sign: *mut ::std::os::raw::c_int,
            count: *mut isize,
            magnitude: *mut emacs_limb_t,
        ) -> bool,
    >,
    pub make_big_integer: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            sign: ::std::os::raw::c_int,
            count: isize,
            magnitude: *const emacs_limb_t,
        ) -> emacs_value,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of emacs_env_27"][::std::mem::size_of::<emacs_env_27>() - 280usize];
    ["Alignment of emacs_env_27"][::std::mem::align_of::<emacs_env_27>() - 8usize];
    ["Offset of field: emacs_env_27::size"][::std::mem::offset_of!(emacs_env_27, size) - 0usize];
    ["Offset of field: emacs_env_27::private_members"]
        [::std::mem::offset_of!(emacs_env_27, private_members) - 8usize];
    ["Offset of field: emacs_env_27::make_global_ref"]
        [::std::mem::offset_of!(emacs_env_27, make_global_ref) - 16usize];
    ["Offset of field: emacs_env_27::free_global_ref"]
        [::std::mem::offset_of!(emacs_env_27, free_global_ref) - 24usize];
    ["Offset of field: emacs_env_27::non_local_exit_check"]
        [::std::mem::offset_of!(emacs_env_27, non_local_exit_check) - 32usize];
    ["Offset of field: emacs_env_27::non_local_exit_clear"]
        [::std::mem::offset_of!(emacs_env_27, non_local_exit_clear) - 40usize];
    ["Offset of field: emacs_env_27::non_local_exit_get"]
        [::std::mem::offset_of!(emacs_env_27, non_local_exit_get) - 48usize];
    ["Offset of field: emacs_env_27::non_local_exit_signal"]
        [::std::mem::offset_of!(emacs_env_27, non_local_exit_signal) - 56usize];
    ["Offset of field: emacs_env_27::non_local_exit_throw"]
        [::std::mem::offset_of!(emacs_env_27, non_local_exit_throw) - 64usize];
    ["Offset of field: emacs_env_27::make_function"]
        [::std::mem::offset_of!(emacs_env_27, make_function) - 72usize];
    ["Offset of field: emacs_env_27::funcall"]
        [::std::mem::offset_of!(emacs_env_27, funcall) - 80usize];
    ["Offset of field: emacs_env_27::intern"]
        [::std::mem::offset_of!(emacs_env_27, intern) - 88usize];
    ["Offset of field: emacs_env_27::type_of"]
        [::std::mem::offset_of!(emacs_env_27, type_of) - 96usize];
    ["Offset of field: emacs_env_27::is_not_nil"]
        [::std::mem::offset_of!(emacs_env_27, is_not_nil) - 104usize];
    ["Offset of field: emacs_env_27::eq"][::std::mem::offset_of!(emacs_env_27, eq) - 112usize];
    ["Offset of field: emacs_env_27::extract_integer"]
        [::std::mem::offset_of!(emacs_env_27, extract_integer) - 120usize];
    ["Offset of field: emacs_env_27::make_integer"]
        [::std::mem::offset_of!(emacs_env_27, make_integer) - 128usize];
    ["Offset of field: emacs_env_27::extract_float"]
        [::std::mem::offset_of!(emacs_env_27, extract_float) - 136usize];
    ["Offset of field: emacs_env_27::make_float"]
        [::std::mem::offset_of!(emacs_env_27, make_float) - 144usize];
    ["Offset of field: emacs_env_27::copy_string_contents"]
        [::std::mem::offset_of!(emacs_env_27, copy_string_contents) - 152usize];
    ["Offset of field: emacs_env_27::make_string"]
        [::std::mem::offset_of!(emacs_env_27, make_string) - 160usize];
    ["Offset of field: emacs_env_27::make_user_ptr"]
        [::std::mem::offset_of!(emacs_env_27, make_user_ptr) - 168usize];
    ["Offset of field: emacs_env_27::get_user_ptr"]
        [::std::mem::offset_of!(emacs_env_27, get_user_ptr) - 176usize];
    ["Offset of field: emacs_env_27::set_user_ptr"]
        [::std::mem::offset_of!(emacs_env_27, set_user_ptr) - 184usize];
    ["Offset of field: emacs_env_27::get_user_finalizer"]
        [::std::mem::offset_of!(emacs_env_27, get_user_finalizer) - 192usize];
    ["Offset of field: emacs_env_27::set_user_finalizer"]
        [::std::mem::offset_of!(emacs_env_27, set_user_finalizer) - 200usize];
    ["Offset of field: emacs_env_27::vec_get"]
        [::std::mem::offset_of!(emacs_env_27, vec_get) - 208usize];
    ["Offset of field: emacs_env_27::vec_set"]
        [::std::mem::offset_of!(emacs_env_27, vec_set) - 216usize];
    ["Offset of field: emacs_env_27::vec_size"]
        [::std::mem::offset_of!(emacs_env_27, vec_size) - 224usize];
    ["Offset of field: emacs_env_27::should_quit"]
        [::std::mem::offset_of!(emacs_env_27, should_quit) - 232usize];
    ["Offset of field: emacs_env_27::process_input"]
        [::std::mem::offset_of!(emacs_env_27, process_input) - 240usize];
    ["Offset of field: emacs_env_27::extract_time"]
        [::std::mem::offset_of!(emacs_env_27, extract_time) - 248usize];
    ["Offset of field: emacs_env_27::make_time"]
        [::std::mem::offset_of!(emacs_env_27, make_time) - 256usize];
    ["Offset of field: emacs_env_27::extract_big_integer"]
        [::std::mem::offset_of!(emacs_env_27, extract_big_integer) - 264usize];
    ["Offset of field: emacs_env_27::make_big_integer"]
        [::std::mem::offset_of!(emacs_env_27, make_big_integer) - 272usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct emacs_env_28 {
    pub size: isize,
    pub private_members: *mut emacs_env_private,
    pub make_global_ref: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, value: emacs_value) -> emacs_value,
    >,
    pub free_global_ref:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, global_value: emacs_value)>,
    pub non_local_exit_check:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env) -> emacs_funcall_exit>,
    pub non_local_exit_clear: ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env)>,
    pub non_local_exit_get: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            symbol: *mut emacs_value,
            data: *mut emacs_value,
        ) -> emacs_funcall_exit,
    >,
    pub non_local_exit_signal: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, symbol: emacs_value, data: emacs_value),
    >,
    pub non_local_exit_throw: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, tag: emacs_value, value: emacs_value),
    >,
    pub make_function: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            min_arity: isize,
            max_arity: isize,
            func: ::std::option::Option<
                unsafe extern "C" fn(
                    env: *mut emacs_env,
                    nargs: isize,
                    args: *mut emacs_value,
                    data: *mut ::std::os::raw::c_void,
                ) -> emacs_value,
            >,
            docstring: *const ::std::os::raw::c_char,
            data: *mut ::std::os::raw::c_void,
        ) -> emacs_value,
    >,
    pub funcall: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            func: emacs_value,
            nargs: isize,
            args: *mut emacs_value,
        ) -> emacs_value,
    >,
    pub intern: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            name: *const ::std::os::raw::c_char,
        ) -> emacs_value,
    >,
    pub type_of: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> emacs_value,
    >,
    pub is_not_nil:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> bool>,
    pub eq: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, a: emacs_value, b: emacs_value) -> bool,
    >,
    pub extract_integer: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> intmax_t,
    >,
    pub make_integer: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, n: intmax_t) -> emacs_value,
    >,
    pub extract_float:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> f64>,
    pub make_float:
        ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env, d: f64) -> emacs_value>,
    pub copy_string_contents: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            value: emacs_value,
            buf: *mut ::std::os::raw::c_char,
            len: *mut isize,
        ) -> bool,
    >,
    pub make_string: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            str_: *const ::std::os::raw::c_char,
            len: isize,
        ) -> emacs_value,
    >,
    pub make_user_ptr: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            fin: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
            ptr: *mut ::std::os::raw::c_void,
        ) -> emacs_value,
    >,
    pub get_user_ptr: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> *mut ::std::os::raw::c_void,
    >,
    pub set_user_ptr: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            arg: emacs_value,
            ptr: *mut ::std::os::raw::c_void,
        ),
    >,
    pub get_user_finalizer: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, uptr: emacs_value) -> emacs_finalizer,
    >,
    pub set_user_finalizer: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            arg: emacs_value,
            fin: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        ),
    >,
    pub vec_get: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, vector: emacs_value, index: isize) -> emacs_value,
    >,
    pub vec_set: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            vector: emacs_value,
            index: isize,
            value: emacs_value,
        ),
    >,
    pub vec_size: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, vector: emacs_value) -> isize,
    >,
    pub should_quit: ::std::option::Option<unsafe extern "C" fn(env: *mut emacs_env) -> bool>,
    pub process_input: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env) -> emacs_process_input_result,
    >,
    pub extract_time: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> timespec,
    >,
    pub make_time: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, time: timespec) -> emacs_value,
    >,
    pub extract_big_integer: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            arg: emacs_value,
            sign: *mut ::std::os::raw::c_int,
            count: *mut isize,
            magnitude: *mut emacs_limb_t,
        ) -> bool,
    >,
    pub make_big_integer: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            sign: ::std::os::raw::c_int,
            count: isize,
            magnitude: *const emacs_limb_t,
        ) -> emacs_value,
    >,
    pub get_function_finalizer: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, arg: emacs_value) -> emacs_finalizer,
    >,
    pub set_function_finalizer: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            arg: emacs_value,
            fin: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
        ),
    >,
    pub open_channel: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            pipe_process: emacs_value,
        ) -> ::std::os::raw::c_int,
    >,
    pub make_interactive: ::std::option::Option<
        unsafe extern "C" fn(env: *mut emacs_env, function: emacs_value, spec: emacs_value),
    >,
    pub make_unibyte_string: ::std::option::Option<
        unsafe extern "C" fn(
            env: *mut emacs_env,
            str_: *const ::std::os::raw::c_char,
            len: isize,
        ) -> emacs_value,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of emacs_env_28"][::std::mem::size_of::<emacs_env_28>() - 320usize];
    ["Alignment of emacs_env_28"][::std::mem::align_of::<emacs_env_28>() - 8usize];
    ["Offset of field: emacs_env_28::size"][::std::mem::offset_of!(emacs_env_28, size) - 0usize];
    ["Offset of field: emacs_env_28::private_members"]
        [::std::mem::offset_of!(emacs_env_28, private_members) - 8usize];
    ["Offset of field: emacs_env_28::make_global_ref"]
        [::std::mem::offset_of!(emacs_env_28, make_global_ref) - 16usize];
    ["Offset of field: emacs_env_28::free_global_ref"]
        [::std::mem::offset_of!(emacs_env_28, free_global_ref) - 24usize];
    ["Offset of field: emacs_env_28::non_local_exit_check"]
        [::std::mem::offset_of!(emacs_env_28, non_local_exit_check) - 32usize];
    ["Offset of field: emacs_env_28::non_local_exit_clear"]
        [::std::mem::offset_of!(emacs_env_28, non_local_exit_clear) - 40usize];
    ["Offset of field: emacs_env_28::non_local_exit_get"]
        [::std::mem::offset_of!(emacs_env_28, non_local_exit_get) - 48usize];
    ["Offset of field: emacs_env_28::non_local_exit_signal"]
        [::std::mem::offset_of!(emacs_env_28, non_local_exit_signal) - 56usize];
    ["Offset of field: emacs_env_28::non_local_exit_throw"]
        [::std::mem::offset_of!(emacs_env_28, non_local_exit_throw) - 64usize];
    ["Offset of field: emacs_env_28::make_function"]
        [::std::mem::offset_of!(emacs_env_28, make_function) - 72usize];
    ["Offset of field: emacs_env_28::funcall"]
        [::std::mem::offset_of!(emacs_env_28, funcall) - 80usize];
    ["Offset of field: emacs_env_28::intern"]
        [::std::mem::offset_of!(emacs_env_28, intern) - 88usize];
    ["Offset of field: emacs_env_28::type_of"]
        [::std::mem::offset_of!(emacs_env_28, type_of) - 96usize];
    ["Offset of field: emacs_env_28::is_not_nil"]
        [::std::mem::offset_of!(emacs_env_28, is_not_nil) - 104usize];
    ["Offset of field: emacs_env_28::eq"][::std::mem::offset_of!(emacs_env_28, eq) - 112usize];
    ["Offset of field: emacs_env_28::extract_integer"]
        [::std::mem::offset_of!(emacs_env_28, extract_integer) - 120usize];
    ["Offset of field: emacs_env_28::make_integer"]
        [::std::mem::offset_of!(emacs_env_28, make_integer) - 128usize];
    ["Offset of field: emacs_env_28::extract_float"]
        [::std::mem::offset_of!(emacs_env_28, extract_float) - 136usize];
    ["Offset of field: emacs_env_28::make_float"]
        [::std::mem::offset_of!(emacs_env_28, make_float) - 144usize];
    ["Offset of field: emacs_env_28::copy_string_contents"]
        [::std::mem::offset_of!(emacs_env_28, copy_string_contents) - 152usize];
    ["Offset of field: emacs_env_28::make_string"]
        [::std::mem::offset_of!(emacs_env_28, make_string) - 160usize];
    ["Offset of field: emacs_env_28::make_user_ptr"]
        [::std::mem::offset_of!(emacs_env_28, make_user_ptr) - 168usize];
    ["Offset of field: emacs_env_28::get_user_ptr"]
        [::std::mem::offset_of!(emacs_env_28, get_user_ptr) - 176usize];
    ["Offset of field: emacs_env_28::set_user_ptr"]
        [::std::mem::offset_of!(emacs_env_28, set_user_ptr) - 184usize];
    ["Offset of field: emacs_env_28::get_user_finalizer"]
        [::std::mem::offset_of!(emacs_env_28, get_user_finalizer) - 192usize];
    ["Offset of field: emacs_env_28::set_user_finalizer"]
        [::std::mem::offset_of!(emacs_env_28, set_user_finalizer) - 200usize];
    ["Offset of field: emacs_env_28::vec_get"]
        [::std::mem::offset_of!(emacs_env_28, vec_get) - 208usize];
    ["Offset of field: emacs_env_28::vec_set"]
        [::std::mem::offset_of!(emacs_env_28, vec_set) - 216usize];
    ["Offset of field: emacs_env_28::vec_size"]
        [::std::mem::offset_of!(emacs_env_28, vec_size) - 224usize];
    ["Offset of field: emacs_env_28::should_quit"]
        [::std::mem::offset_of!(emacs_env_28, should_quit) - 232usize];
    ["Offset of field: emacs_env_28::process_input"]
        [::std::mem::offset_of!(emacs_env_28, process_input) - 240usize];
    ["Offset of field: emacs_env_28::extract_time"]
        [::std::mem::offset_of!(emacs_env_28, extract_time) - 248usize];
    ["Offset of field: emacs_env_28::make_time"]
        [::std::mem::offset_of!(emacs_env_28, make_time) - 256usize];
    ["Offset of field: emacs_env_28::extract_big_integer"]
        [::std::mem::offset_of!(emacs_env_28, extract_big_integer) - 264usize];
    ["Offset of field: emacs_env_28::make_big_integer"]
        [::std::mem::offset_of!(emacs_env_28, make_big_integer) - 272usize];
    ["Offset of field: emacs_env_28::get_function_finalizer"]
        [::std::mem::offset_of!(emacs_env_28, get_function_finalizer) - 280usize];
    ["Offset of field: emacs_env_28::set_function_finalizer"]
        [::std::mem::offset_of!(emacs_env_28, set_function_finalizer) - 288usize];
    ["Offset of field: emacs_env_28::open_channel"]
        [::std::mem::offset_of!(emacs_env_28, open_channel) - 296usize];
    ["Offset of field: emacs_env_28::make_interactive"]
        [::std::mem::offset_of!(emacs_env_28, make_interactive) - 304usize];
    ["Offset of field: emacs_env_28::make_unibyte_string"]
        [::std::mem::offset_of!(emacs_env_28, make_unibyte_string) - 312usize];
};
unsafe extern "C" {
    pub fn emacs_module_init(runtime: *mut emacs_runtime) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct emacs_runtime_private {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct emacs_env_private {
    pub _address: u8,
}
